package designpattern.factory;

/**
 * 工厂方法模式
 * 定义：定义了一个创建对象的接口，但由子类决定要实例化的类是哪一个。工厂方法让类把实例化推迟到子类。
 * <p>
 * 抽象工厂模式
 * 定义：提供一个接口，用于创建相关或依赖对象的家族，而不需要明确指定具体类。
 * <p>
 * 原则：依赖抽象，不要依赖具体类。
 * 作用：可以将对象的创建封装起来，以便于得到更松耦合、更有弹性的设计。
 * <p>
 * 要点
 * 1、所有的工厂都是用来封装对象的创建
 * 2、简单工厂，虽然不是真正的设计模式，但仍不失为一个简单的方法，可以将客户程序从具体类解耦
 * 3、工厂方法使用继承：把对象的创建委托给子类，子类实现工厂方法来创建对象
 * 4、抽象工厂使用对象组合：对象的创建被实现在工厂接口所暴露出来的方法中
 * 5、所有工厂模式都通过减少应用程序和具体类之间的依赖促进松耦合
 * 6、工厂方法允许类将实例化延迟到子类进行
 * 7、抽象工厂创建相关的对象家族，而不需要依赖它们的具体类
 * 8、依赖倒置原则，指导我们避免依赖具体类型，而要依赖抽象
 * 9、工厂是很有威力的技巧，帮助我们针对抽象编程，而不要针对具体类编程
 *
 * @author wangdongxing
 * @since 2018/11/16 3:41 PM
 */
public class Main {
}
